TEXTFILE_SEPARATOR = '|'

UI_COMMAND_PROMPT = """
Выберите следующую комманду:
1 - Вывод записей справочника
2 - Добавление новой записи в справочник
3 - Редактирование записи в справочнике
4 - Поиск записи в справочнике
5 - Выход
"""

ADD_ENTRY_PROMTS = {
    'name': "Введите имя: ",
    'second_name': "Введите отчество: ",
    'last_name': "Введите фамилию: ",
    'employee': "Введите место работы: ",
    'work_phone': "Введите рабочий телефон: ",
    'mobile_phone': "Введите мобильный телефон: ",
}

UI_COMMAND_QUIT = 5